In [1]:
import numpy as np
import pandas as pd
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df['States']="CA NV AZ".split()
df.set_index('States',inplace=True)
print(df)

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

## adding the row

In [37]:
df.loc[len(df.index)] = [3.0 ,5]
df.head()

        new col    C
States
CA          1.0  1.0
NV          2.0  2.0
AZ          NaN  3.0
3           3.0  5.0
4           3.0  5.0

In [38]:
df['B']=20

## removing column

In [40]:
# remove the column b
df.drop('B' , axis=1,inplace=True)
df.head(1)
# col b is removed

        new col    C
States
CA          1.0  1.0

## rename the columns

In [48]:
df.rename(columns={"new col":'Col1' , 'C':'Col2'},inplace=True ) # df.rename()

In [49]:
df.head(0)

Empty DataFrame
Columns: [Col1, Col2]
Index: []

## changing the index

In [65]:
df['Index'] = [x for x in range(1,len(df)+1) ] # creating column , list comprehension
df.set_index('Index' ,inplace=True) #  df.set_index()

In [66]:
df.head(2)

       Col1  Col2
Index
1       1.0   1.0
2       2.0   2.0

## drop the na /null rows

In [119]:
print('Droping any rows with NaN values \n')
df.dropna(axis=0 , how='any' ,inplace=True)
df

Droping any rows with NaN values

       Col1  Col2  Col3
Index
2       2.0   2.0   2.0
4       3.0   5.0   4.0
7       3.0   5.0   8.0
8       3.0   5.0   9.0
9       3.0   5.0  10.0

## drop the nan/na columns

In [120]:
df.dropna(axis=1 , how='any')

       Col1  Col2  Col3
Index
2       2.0   2.0   2.0
4       3.0   5.0   4.0
7       3.0   5.0   8.0
8       3.0   5.0   9.0
9       3.0   5.0  10.0

## Dropping a row with a minimum 2 NaN value using 'thresh' parameter

In [121]:
df.dropna(axis=0 , thresh=2)

       Col1  Col2  Col3
Index
2       2.0   2.0   2.0
4       3.0   5.0   4.0
7       3.0   5.0   8.0
8       3.0   5.0   9.0
9       3.0   5.0  10.0

## drop the row by their index number

In [117]:
# delete the last two rows
df.drop([8,9] )  # insert there index number 
         # or 
#df.drop(labels=[8,9])
# inplace = True ...to make permanent changes

       Col1  Col2  Col3
Index
2       2.0   2.0   2.0
4       3.0   5.0   4.0
7       3.0   5.0   8.0

## fill na  with default values

In [123]:
a = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df['States']="CA NV AZ".split()
df.set_index('States',inplace=True)
print(df)

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

In [124]:
df.fillna(value='default_value' )

                    A              B  C
States
CA                  1              5  1
NV                  2  default_value  2
AZ      default_value  default_value  3

## Filling na values with a computed value (mean of column A here

In [128]:
df['A'].fillna(value=df.A.mean() , inplace=True)
df['B'].fillna(value=df.B.mean(), inplace=True)
df['C'].fillna(value= df.C.mean(),inplace=True)
df

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  5.0  2
AZ      1.5  5.0  3

## lower casing the column name

In [142]:
# make the colums of table a in lower case
new_col = [x.lower() for x  in a.columns]
new_col
a.columns = new_col
a.columns

Index(['a', 'b', 'c'], dtype='object')

## creating the data frame

In [144]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)

In [145]:
df.head(0)

Empty DataFrame
Columns: [Company, Person, Sales]
Index: []

## arranging the data group wise & compute mean

In [149]:
# calculate the mean of sales by company groupwise 
print('Grouping by "company" column & calculating mean ')
df.groupby('Company').Sales.mean()

Grouping by "company" column & calculating mean

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

## ## arrange the data in one line(transpose)

In [167]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [166]:
df.groupby('Company').describe().loc['FB']# extracting only 'FB' elements

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [165]:
pd.DataFrame (df.groupby('Company').describe().loc['FB'])

                     FB
Sales count    2.000000
      mean   296.500000
      std     75.660426
      min    243.000000
      25%    269.750000
      50%    296.500000
      75%    323.250000
      max    350.000000

In [171]:
# arrange the data in one line 
pd.DataFrame (df.groupby('Company').describe().loc['FB']).transpose()

   Sales
   count   mean        std    min     25%    50%     75%    max
FB   2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0

# #Concatenation the two data frames

In [177]:
# Merging two data frames
# Creating data frames
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [178]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[0, 1, 2, 3])
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [176]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8,9,10,11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## concatenation (axis=0)

In [188]:
# concate the df1,df2,df3 along the row(axis=0) 

result = pd.concat([df1,df2,df3] , axis=0)
print('\n after concatenation along the row (axis=0)  \n ')
result

 after concatenation along the row (axis=0)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
0    A4   B4   C4   D4
1    A5   B5   C5   D5
2    A6   B6   C6   D6
3    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [189]:
result.iloc[4]

A    A4
B    B4
C    C4
D    D4
Name: 0, dtype: object

## concatenation (axis=1) column wise

In [192]:
# concatenating df1,df2,d3 along the columns (axis=1)
result_1 = pd.concat([df1,df2,df3] ,axis=1)
print('after concatenaing the column wise (axis=1)')
result_1

after concatenaing the column wise (axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0   A4   B4   C4   D4  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1   A5   B5   C5   D5  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2   A6   B6   C6   D6  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [193]:
result_1.fillna(value=0 , inplace=True)
result_1

     A   B   C   D   A   B   C   D    A    B    C    D
0   A0  B0  C0  D0  A4  B4  C4  D4    0    0    0    0
1   A1  B1  C1  D1  A5  B5  C5  D5    0    0    0    0
2   A2  B2  C2  D2  A6  B6  C6  D6    0    0    0    0
3   A3  B3  C3  D3  A7  B7  C7  D7    0    0    0    0
8    0   0   0   0   0   0   0   0   A8   B8   C8   D8
9    0   0   0   0   0   0   0   0   A9   B9   C9   D9
10   0   0   0   0   0   0   0   0  A10  B10  C10  D10
11   0   0   0   0   0   0   0   0  A11  B11  C11  D11

#  #merging  the two dataframes

merging the two dataframes by using the common key

In [197]:
# create dataframes
left = pd.DataFrame({'key': ['K0', 'K8', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [198]:
left

  key   A   B
0  K0  A0  B0
1  K8  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [199]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

## merging by common key

In [203]:
# merging by common key
mrg = pd.merge(left,right,how='inner' , on='key')
mrg  
# here key k8 and k1 doesn't match 
# so there result  are skipped

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3